<?php
/**
 * Created by PhpStorm.
 * User: xiongfanglei
 * Date: 15-5-12
 * Time: 上午10:36
 */

class TempList
{
    public static $Type = array(
        0=>"未知",
        1=>"办公室",
        2=>"餐厅",
        3=>"消配中心"
    );

    public static $service = array(
        0=>"全部",
        1=>"记时服务组",
        2=>"月薪服务组"
    );

    //计时服务组
    public static $PT = array(
        0=>'小时工资',
        1=>'正常工作工时薪资',
        2=>'带薪休息',
        3=>'节假日津贴',
        4=>'晚班津贴',
        5=>'早班津贴',
        6=>'假期工资 合计',
        7=>'超工时津贴',
        8=>'外送工资',
        9=>'骑手津贴',
        10=>'恶劣气候津贴',
        11=>'高温补贴',
        12=>'厨师长津贴',
        13=>'郊县津贴',
        14=>'异地津贴(PT)',
        15=>'税前捐款',
        16=>'税前调整',
        17=>'Gross Pay for Report',
        18=>'生育保险员工部分补缴',
        19=>'生育保险员工部分',
        20=>'工伤保险员工部分补缴',
        21=>'大病互助保员工部分补缴',
        22=>'医疗保险员工部分补缴',
        23=>'失业保险员工部分补缴',
        24=>'养老保险员工部分补缴',
        25=>'大病互助保险个人部分',
        26=>'失业保险员工部分',
        27=>'医疗保险员工部分',
        28=>'养老保险员工部分',
        29=>'住房公积金员工部分',
        30=>'住房公积金员工部分补缴',
        31=>'个人所得税',
        32=>'税后调整',
        33=>'净收入'
    );

    //月薪服务组
    public static $FC = array(
        0=>'基本薪资',
        1=>'基本薪资调整',
        2=>'厨师长津贴',
        3=>'骑手津贴',
        4=>'外送工资',
        5=>'超工时津贴(月薪)',
        6=>'节假日津贴',
        7=>'考勤扣款',
        8=>'高温补贴',
        9=>'晚班津贴',
        10=>'早班津贴',
        11=>'恶劣气候津贴',
        12=>'税前调整',
        13=>'税前捐款',
        14=>'Gross Pay for Report',
        15=>'养老保险员工部分补缴',
        16=>'养老保险员工部分',
        17=>'医疗保险员工部分',
        18=>'失业保险员工部分',
        19=>'大病互助保险个人部分',
        20=>'生育保险员工部分补缴',
        21=>'生育保险员工部分',
        22=>'工伤保险员工部分补缴',
        23=>'大病互助保员工部分补缴',
        24=>'失业保险员工部分补缴',
        25=>'医疗保险员工部分补缴',
        26=>'住房公积金员工部分',
        27=>'住房公积金员工部分补缴',
        28=>'薪金税 应税收入',
        29=>'个人所得税',
        30=>'税后调整',
        31=>'离职补偿金',
        32=>'离职补偿金所得税',
        33=>'净收入'
    );
}